Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.AnalysisBars Property
 The analysis bars of the analysis part.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisBar> AnalysisBars { get; }
Public ReadOnly Property AnalysisBars As List(Of AnalysisBar)
	Get
Property Value
Type: List<AnalysisBar>
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace